[
  {
    "id": 1,
    "title": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "isbn": "9780547928227",
    "description": "Bilbo Baggins is a hobbit who enjoys a comfortable, unambitious life, rarely traveling any farther than his pantry or cellar. But his contentment is disturbed when the wizard Gandalf and a company of dwarves arrive on his doorstep one day to whisk him away on an adventure. They have launched a plot to raid the treasure hoard guarded by Smaug the Magnificent, a large and very dangerous dragon. Bilbo reluctantly joins their quest, unaware that on his journey to the Lonely Mountain he will encounter both a magic ring and a frightening creature known as Gollum.",
    "cover": "example.com/cover.jpg"
  },
  {
    "id": 2,
    "title": "The Fellowship of the Ring",
    "author": "J.R.R. Tolkien",
    "isbn": "9780547928227",
    "description": "The first volume in J.R.R. Tolkien's epic adventure The Lord of the Rings. Bilbo Baggins is a hobbit who enjoys a comfortable, unambitious life, rarely traveling any farther than his pantry or cellar. But his contentment is disturbed when the wizard Gandalf and a company of dwarves arrive on his doorstep one day to whisk him away on an adventure. They have launched a plot to raid the treasure hoard guarded by Smaug the Magnificent, a large and very dangerous dragon. Bilbo reluctantly joins their quest, unaware that on his journey to the Lonely Mountain he will encounter both a magic ring and a frightening creature known as Gollum.",
    "cover": "example.com/cover.jpg"
  },
  {
    "id": 3,
    "title": "The Hitchhiker's Guide to the Galaxy",
    "author": "Douglas Adams",
    "isbn": "9780345391803",
    "description": "The Hitchhiker's Guide to the Galaxy is a comedy science fiction series created by Douglas Adams. Originally a radio comedy broadcast on BBC Radio 4 in 1978, it was later adapted to other formats, including stage shows, novels, comic books, a 1981 TV series, a 1984 video game, and 2005 feature film. The series follows the travails of Arthur Dent and his friend Ford Prefect, who are swept up in the Earth's destruction to make way for a new hyperspace bypass. Together they hitch a ride on a spacecraft bound for the distant planet Magrathea, where they hope to find answers to the meaning of life, the universe, and everything.",
    "cover": "example.com/cover.jpg"
  }
]
